import networkx as nx

from collections import deque


def bfs(graph, start):
    visited = set([start])
    queue = deque([(start, 0)])
    while queue:
        node, level = queue.popleft()
        print(f"{level:<2}"+"-" * level + node + "  ")
        for neighbor in graph.neighbors(node):
            if neighbor not in visited:
                visited.add(neighbor)
                queue.append((neighbor, level + 1))


def dfs(graph, start):
    visited = set()

    def visit(node, level=0):
        visited.add(node)
        print(f"{level:<2}"+"-" * level + node + "  ")

        for neighbor in graph.neighbors(node):
            if neighbor not in visited:
                visit(neighbor, level + 1)

    visit(start)


def main():
    G = nx.Graph()

    edges = [
        # Червона лінія
        ("Академмістечко", "Житомирська", 1.7),
        ("Житомирська", "Святошин", 1.4),
        ("Святошин", "Нивки", 1.3),
        ("Нивки", "Берестейська", 1.1),
        ("Берестейська", "Шулявська", 1.0),
        ("Шулявська", "Політехнічний інститут", 1.1),
        ("Політехнічний інститут", "Вокзальна", 1.3),
        ("Вокзальна", "Університет", 1.1),
        ("Університет", "Театральна", 0.9),
        ("Театральна", "Хрещатик", 0.7),
        ("Хрещатик", "Арсенальна", 2.6),
        ("Арсенальна", "Дніпро", 1.9),
        ("Дніпро", "Гідропарк", 1.0),
        ("Гідропарк", "Лівобережна", 1.2),
        ("Лівобережна", "Дарниця", 1.1),
        ("Дарниця", "Чернігівська", 1.3),
        ("Чернігівська", "Лісова", 1.2),
        # Синя лінія
        ("Героїв Дніпра", "Мінська", 1.2),
        ("Мінська", "Оболонь", 1.1),
        ("Оболонь", "Почайна", 1.4),
        ("Почайна", "Тараса Шевченка", 1.6),
        ("Тараса Шевченка", "Контрактова площа", 1.2),
        ("Контрактова площа", "Поштова площа", 1.0),
        ("Поштова площа", "Майдан Незалежності", 1.2),
        ("Майдан Незалежності", "Площа Українських Героїв", 0.8),
        ("Площа Українських Героїв", "Олімпійська", 1.0),
        ("Олімпійська", "Палац «Україна»", 1.2),
        ("Палац «Україна»", "Либідська", 1.0),
        ("Либідська", "Деміївська", 0.9),
        ("Деміївська", "Голосіївська", 1.3),
        ("Голосіївська", "Васильківська", 1.2),
        ("Васильківська", "Виставковий центр", 1.6),
        ("Виставковий центр", "Іподром", 1.0),
        ("Іподром", "Теремки", 1.2),
        # Зелена лінія
        ("Сирець", "Дорогожичі", 1.4),
        ("Дорогожичі", "Лук’янівська", 1.5),
        ("Лук’янівська", "Золоті ворота", 1.3),
        ("Золоті ворота", "Палац спорту", 0.8),
        ("Палац спорту", "Кловська", 1.0),
        ("Кловська", "Печерська", 1.1),
        ("Печерська", "Дружби народів", 1.2),
        ("Дружби народів", "Видубичі", 1.3),
        ("Видубичі", "Славутич", 2.4),
        ("Славутич", "Осокорки", 1.0),
        ("Осокорки", "Позняки", 1.2),
        ("Позняки", "Харківська", 1.1),
        ("Харківська", "Вирлиця", 1.3),
        ("Вирлиця", "Бориспільська", 1.0),
        ("Бориспільська", "Червоний хутір", 1.3),
        ("Театральна", "Золоті ворота", 0.1),
        ("Хрещатик", "Майдан Незалежності", 0.1),
        ("Палац спорту", "Площа Українських Героїв", 0.1),
    ]

    for u, v, d in edges:
        G.add_edge(u, v, distance=d)

    print("DFS:")
    dfs(G, "Академмістечко")

    print("\n-----------------\n")

    print("BFS:")
    bfs(G, "Академмістечко")


if __name__ == "__main__":
    main()
